Revit 2018 API
FilterCategoryRule Members
The FilterCategoryRule type exposes the following members.
Constructors
Name | Description
FilterCategoryRule
 Constructs a new instance of FilterCategoryRule.
Methods
Name | Description
AllCategoriesFilterable
 Checks that all of the given categories are filterable.
Dispose |  (Inherited from FilterRule.)
ElementPasses
 Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
 (Inherited from FilterRule.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCategories
 Gets the rule's categories.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetCategories
 Sets the rule's categories.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from FilterRule.)
See Also
FilterCategoryRule Class
Autodesk.Revit.DB Namespace